luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSrc_regdef.h
/** \brief  FCE Service requests */
typedef volatile struct _Ifx_SRC_FCE
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, FCE Error Service Request */
} Ifx_SRC_FCE;

/** \brief  GPSR Service requests */
typedef volatile struct _Ifx_SRC_GPSR
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, General Purpose Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, General Purpose Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, General Purpose Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, General Purpose Service Request 3 */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
} Ifx_SRC_GPSR;

/** \brief  GPT12 Service requests */
typedef volatile struct _Ifx_SRC_GPT12
{
    Ifx_SRC_SRCR CIRQ;                      /**< \brief 0, GPT12 CAPREL Service Request */
    Ifx_SRC_SRCR T2;                        /**< \brief 4, GPT12 T2 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T3;                        /**< \brief 8, GPT12 T3 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T4;                        /**< \brief C, GPT12 T4 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T5;                        /**< \brief 10, GPT12 T5 Overflow/Underflow Service Request */
    Ifx_SRC_SRCR T6;                        /**< \brief 14, GPT12 T6 Overflow/Underflow Service Request */
    unsigned char reserved_18[24];          /**< \brief 18, \internal Reserved */
} Ifx_SRC_GPT12;

/** \brief  GTM Service requests */
typedef volatile struct _Ifx_SRC_GTM
{
    Ifx_SRC_SRCR AEIIRQ;                    /**< \brief 0, GTM AEI Shared Service Request */
    Ifx_SRC_SRCR ARUIRQ[3];                 /**< \brief 4, GTM ARU Shared Service Request */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_SRC_SRCR BRCIRQ;                    /**< \brief 14, GTM BRC Shared Service Request */
    Ifx_SRC_SRCR CMPIRQ;                    /**< \brief 18, GTM CMP Shared Service Request */
    Ifx_SRC_SRCR SPEIRQ[2];                 /**< \brief 1C, GTM SPE Shared Service Request */
    unsigned char reserved_24[8];           /**< \brief 24, \internal Reserved */
    Ifx_SRC_SRCR PSM[1][8];                 /**< \brief 2C, GTM PSM Shared Service Request */
    unsigned char reserved_4C[88];          /**< \brief 4C, \internal Reserved */
    Ifx_SRC_SRCR DPLL[27];                  /**< \brief A4, GTM DPLL Service Request */
    unsigned char reserved_110[96];         /**< \brief 110, \internal Reserved */
    Ifx_SRC_SRCR ERR;                       /**< \brief 170, GTM Error Service Request */
    unsigned char reserved_174[12];         /**< \brief 174, \internal Reserved */
    Ifx_SRC_SRCR TIM[4][8];                 /**< \brief 180, GTM TIM Shared Service Request */
    unsigned char reserved_200[384];        /**< \brief 200, \internal Reserved */
    Ifx_SRC_SRCR MCS[4][8];                 /**< \brief 380, GTM MCS Shared Service Request */
    unsigned char reserved_400[384];        /**< \brief 400, \internal Reserved */
    Ifx_SRC_SRCR TOM[3][8];                 /**< \brief 580, GTM TOM Shared Service Request */
    unsigned char reserved_5E0[416];        /**< \brief 5E0, \internal Reserved */
    Ifx_SRC_SRCR ATOM[5][4];                /**< \brief 780, GTM ATOM Shared Service Request */
    unsigned char reserved_7D0[304];        /**< \brief 7D0, \internal Reserved */
    Ifx_SRC_SRCR MCSW0[4];                  /**< \brief 900, GTM Multi Channel Sequencer 0 Service Request */
    unsigned char reserved_910[48];         /**< \brief 910, \internal Reserved */
    Ifx_SRC_SRCR MCSW1[4];                  /**< \brief 940, GTM Multi Channel Sequencer 1 Service Request */
} Ifx_SRC_GTM;

/** \brief  HSCT Service requests */
typedef volatile struct _Ifx_SRC_HSCT
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, HSCT Service Request */
} Ifx_SRC_HSCT;

/** \brief  HSM Service requests */
typedef volatile struct _Ifx_SRC_HSM
{
    Ifx_SRC_SRCR HSM[2];                    /**< \brief 0, HSM Service Request */
} Ifx_SRC_HSM;

/** \brief  HSSL Service requests */
typedef volatile struct _Ifx_SRC_HSSL
{
    Ifx_SRC_SRCR COK;                       /**< \brief 0, Channel OK Service Request m */
    Ifx_SRC_SRCR RDI;                       /**< \brief 4, Channel Read Data Service Request m */
    Ifx_SRC_SRCR ERR;                       /**< \brief 8, Channel Error ServiceRequest m */
    Ifx_SRC_SRCR TRG;                       /**< \brief C, Channel Trigger Service Request m */
} Ifx_SRC_HSSL;

/** \brief  I2C Service requests */
typedef volatile struct _Ifx_SRC_I2C
{
    Ifx_SRC_SRCR BREQ;                      /**< \brief 0, I2C Burst Data Transfer Request */
    Ifx_SRC_SRCR LBREQ;                     /**< \brief 4, I2C Last Burst Data Transfer Service Request */
    Ifx_SRC_SRCR SREQ;                      /**< \brief 8, I2C Single Data Transfer Service Request */
    Ifx_SRC_SRCR LSREQ;                     /**< \brief C, I2C Last Single Data Transfer Service Request */
    Ifx_SRC_SRCR ERR;                       /**< \brief 10, I2C Error Service Request */
    Ifx_SRC_SRCR P;                         /**< \brief 14, I2C Kernel Service Request */
    unsigned char reserved_18[56];          /**< \brief 18, \internal Reserved */
} Ifx_SRC_I2C;

/** \brief  LMU Service requests */
typedef volatile struct _Ifx_SRC_LMU
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, LMU Service Request */
} Ifx_SRC_LMU;

/** \brief  MSC Service requests */
typedef volatile struct _Ifx_SRC_MSC
{
    Ifx_SRC_SRCR SR0;                       /**< \brief 0, MSC Service Request 0 */
    Ifx_SRC_SRCR SR1;                       /**< \brief 4, MSC Service Request 1 */
    Ifx_SRC_SRCR SR2;                       /**< \brief 8, MSC Service Request 2 */
    Ifx_SRC_SRCR SR3;                       /**< \brief C, MSC Service Request 3 */
    Ifx_SRC_SRCR SR4;                       /**< \brief 10, MSC Service Request 4 */
} Ifx_SRC_MSC;

/** \brief  PMU Service requests */
typedef volatile struct _Ifx_SRC_PMU
{
    Ifx_SRC_SRCR SR;                        /**< \brief 0, PMU  Service Request */
} Ifx_SRC_PMU;

/** \brief  PSI5 Service requests */
typedef volatile struct _Ifx_SRC_PSI5
{
    Ifx_SRC_SRCR SR[8];                     /**< \brief 0, PSI5 Service Request */
} Ifx_SRC_PSI5;

/** \brief  PSI5S Service requests */
typedef volatile struct _Ifx_SRC_PSI5S
{
    Ifx_SRC_SRCR SR[8];                     /**< \brief 0, PSI5-S Service Request */
} Ifx_SRC_PSI5S;

/** \brief  QSPI Service requests */
typedef volatile struct _Ifx_SRC_QSPI
{
    Ifx_SRC_SRCR TX;                        /**< \brief 0, QSPI Transmit Service Request */
    Ifx_SRC_SRCR RX;                        /**< \brief 4, QSPI Receive Service Request */
    Ifx_SRC_SRCR ERR;                       /**< \brief 8, QSPI Error Service Request */
    Ifx_SRC_SRCR PT;                        /**< \brief C, QSPI Phase Transition Service Request */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_SRC_SRCR U;                         /**< \brief 14, QSPI User Defined Service Request */
} Ifx_SRC_QSPI;

/** \brief  SCU Service requests */
typedef volatile struct _Ifx_SRC_SCU
{
    Ifx_SRC_SRCR DTS;                       /**< \brief 0, SCU DTS Busy Service Request */
    Ifx_SRC_SRCR ERU[4];                    /**< \brief 4, SCU ERU Service Request */
} Ifx_SRC_SCU;

/** \brief  SENT Service requests */
typedef volatile struct _Ifx_SRC_SENT
{
    Ifx_SRC_SRCR SR[10];                    /**< \brief 0, SENT TRIG Service Request */
} Ifx_SRC_SENT;

/** \brief  SMU Service requests */
typedef volatile struct _Ifx_SRC_SMU
{
    Ifx_SRC_SRCR SR[3];                     /**< \brief 0, SMU Service Request */
} Ifx_SRC_SMU;

